Revit 2027 API
FluidTemperature Constructor
 Creates a new fluid temperature with given temperature, dynamic viscosity and density.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FluidTemperature(
	double temperature,
	double viscosity,
	double density
)
Public Sub New (
	temperature As Double,
	viscosity As Double,
	density As Double
)
public:
FluidTemperature(
	double temperature,
	double viscosity,
	double density
)
new :
        temperature : float *
        viscosity : float *
        density : float -> FluidTemperature
Parameters
temperature Double
 The temperature value.
viscosity Double
 The dynamic viscosity value.
density Double
 The density value.
See Also
Reference
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace